Revit 2026 API

# RebarShapeConstraint180DegreeBendArcLength Properties

---

The RebarShapeConstraint180DegreeBendArcLength type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |

#### Reference

RebarShapeConstraint180DegreeBendArcLength Class

Autodesk.Revit.DB.Structure Namespace